alefragnani.project-manager
be5invis.toml
bierner.github-markdown-preview
bierner.markdown-checkbox
bierner.markdown-emoji
bierner.markdown-preview-github-styles
bierner.markdown-yaml-preamble
christian-kohler.path-intellisense
codezombiech.gitignore
CoenraadS.bracket-pair-colorizer-2
donjayamanne.git-extension-pack
donjayamanne.githistory
eamodio.gitlens
EditorConfig.EditorConfig
esbenp.prettier-vscode
GitLab.gitlab-workflow
johnpapa.vscode-peacock
KevinRose.vsc-python-indent
ms-azuretools.vscode-docker
ms-python.python
ms-python.vscode-pylance
ms-toolsai.jupyter
ms-vscode-remote.remote-containers
ms-vscode.cpptools
ms-vsliveshare.vsliveshare
ms-vsliveshare.vsliveshare-audio
ms-vsliveshare.vsliveshare-pack
nilpatel.title
patbenatar.advanced-new-file
redhat.vscode-yaml
Rubymaniac.vscode-paste-and-indent
streetsidesoftware.code-spell-checker
vscode-icons-team.vscode-icons
wholroyd.jinja
xaver.clang-format
yzhang.markdown-all-in-one
ziyasal.vscode-open-in-github
zoellner.openapi-preview
