[
  "calendar",
  "periodic-notes",
  "obsidian-tracker",
  "open-note-to-window-title",
  "cm-editor-syntax-highlight-obsidian",
  "obsidian-advanced-uri",
  "hotkey-helper",
  "pane-relief",
  "tag-wrangler",
  "sliding-panes-obsidian"
]