asvetliakov.vscode-neovim
charliermarsh.ruff
editorconfig.editorconfig
ibm.output-colorizer
mquandalle.graphql
ms-python.debugpy
ms-python.python
ms-python.vscode-pylance
ms-vscode.makefile-tools
tamasfe.even-better-toml
tompollak.lazygit-vscode
