# tap "homebrew/cask"
# tap "homebrew/core"
tap "github/gh"
tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "railwaycat/emacsmacport"
tap "ttscoff/thelab"
brew "mas"

# Fonts
cask "font-fira-code-nerd-font"
cask "font-jetbrains-mono-nerd-font"
cask "font-montserrat-alternates"
cask "font-sauce-code-pro-nerd-font"
cask "font-atkinson-hyperlegible"
cask "font-overpass"
# cask "iandol/adobe-fonts/font-source-code-pro"
# cask "iandol/adobe-fonts/font-source-sans"
# cask "iandol/adobe-fonts/font-source-serif"

# *Nix utils
brew "zoxide"
# brew "zsh-autosuggestions"
brew "asdf"
brew "direnv"
brew "duti"
brew "tldr"
brew "tre-command"
brew "exa"
brew "fzf"
brew "svn"  # Fonts need
brew "ispell"

# Libs/dependencies
brew "libvterm"
brew "cmake"

# Dev/Data Tools:
brew "git-lfs"
brew "awscli"
brew "git"
brew "gpg"
brew "hub"
brew "jq"
brew "yq"
brew "yj"
brew "curlie"
brew "bat"
brew "pandoc"
brew "pyright"
brew "ruff"
cask "mactex-no-gui"
brew "rsync"
brew "terraform"
brew "gh"
brew "git-delta"
brew "ripgrep"
brew "coreutils"
brew "fd"
brew "shfmt"
brew "shellcheck"
cask "docker"
cask "alacritty"

# cask "tower"
cask "transmit"
brew "emacs-mac", args: ["with-modules", "with-emacs-big-sur-icon", "with-native-comp" ]
cask "tad"  # CSV Viewer
cask "dash" # Offline Documentation
mas "Patterns", id: 429449079
cask "firefox"
cask "google-chrome"
cask "brave-browser"
cask "arc"
cask "espanso" # Text expansion
cask "shortcat" # keyboard driven clicks

# Organization
cask "slack"
cask "maestral"
cask "1password"
cask "1password-cli"
mas "1Password for Safari", id: 1569813296
cask "fantastical"
cask "cardhop"
cask "discord"
cask "devonthink"
mas "GoodNotes 5", id: 1444383602
mas "Drafts", id: 1435957248
mas "Things 3", id: 904280696
mas "Timery for Toggl", id: 1425368544

# Customization/Utilities
brew "koekeishiya/formulae/yabai"  # Tiling windows
cask "karabiner-elements"
cask "launchbar"
cask "hammerspoon"
cask "bettertouchtool"
cask "linearmouse"

cask "hpedrorodrigues/tools/dockutil"
cask "backblaze"
cask "iina"
mas "CARROT Weather", id: 993487541

brew "noti"
# cask "keybase"
brew "topgrade"
cask "bartender"
cask "timing"
cask "marked"
cask "soulver"
mas "TextSniper", id: 1528890965
brew "switchaudio-osx"
mas  "Tailscale", id: 1475387142

mas "Speedtest", id: 1153157709
mas "Data Jar", id: 1453273600
mas "OpenIn 4 Advanced Link Handler", id: 1643649331 # Customize Link opening
mas "Shareful", id: 1522267256  # Make share menu useful
mas "Service Station", id: 1503136033  # Clean up Services Menu
mas "Peek", id: 1554235898  # Quicklook

# Safari Extensions
mas "about-blank", id: 1239207203
# mas "Wipr", id: 1320666476
mas "Noir", id: 1592917505
mas "Hush", id: 1544743900
mas "SponsorBlock for YouTube", id: 1573461917
mas "Save to Reader", id: 1640236961
mas "Focus (for YouTube)", id: 1514703160
mas "Safari AdBlock - Magic Lasso", id: 1198047227
mas "Baking Soda - Tube Cleaner", id: 1601151613

# Xcode 
mas "Xcode", id: 497799835

# brew "ttscoff/thelab/gather-cli" # requires Xcode


# sometimes
brew "dnscontrol"
mas "Day One", id: 1055511498
mas "Friendly Streaming Browser", id: 553245401
cask "hazel"
mas "DaisyDisk", id: 411643860
cask "little-snitch"
cask "opal"
mas "Amphetamine", id: 937984704
mas "Streaks", id: 963034692

brew "r"
